providers/Sources/src/Partners/HyperTimeTable.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="HyperTimeTable" targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/HyperTimeTable"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/HyperTimeTable" xmlns:ns="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/HyperTimeTable" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/wsdl/HyperTimeTable">
            <xsd:import namespace="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/HyperTimeTable" schemaLocation="HyperTimeTable.xsd"/>
        </xsd:schema>
    </types>
    <message name="RetrieveTimeTableRequest">
        <part name="input" element="ns:RetrieveTimeTableRequest"/>
    </message>
    <message name="RetrieveTimeTableResponse">
        <part name="output" element="ns:RetrievetimeTableResponse"/>
    </message>
    <portType name="HyperTimeTablePortType">
        <operation name="RetrieveTimeTable">
            <input name="input1" message="tns:RetrieveTimeTableRequest"/>
            <output name="output1" message="tns:RetrieveTimeTableResponse"/>
        </operation>
    </portType>
    <binding name="HyperTimeTableBinding" type="tns:HyperTimeTablePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="RetrieveTimeTable">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="HyperTimeTableService">
        <port name="HyperTimeTablePort" binding="tns:HyperTimeTableBinding">
            <soap:address location="http://localhost:9080/HyperTimeTableService/HyperTimeTablePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="HyperTimeTable">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="HyperTimeTablePortTypeRole" portType="tns:HyperTimeTablePortType"/>
    </plnk:partnerLinkType>
</definitions>
