jSeduiteBpelComponent/test/HyperTimeTable-RetrieveTimeTable/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hyp="http://modalis.i3s.unice.fr/jSeduite/orchestrations/schema/HyperTimeTable">
  <soapenv:Body>
    <hyp:RetrieveTimeTableRequest>
      <hyp:promo>cip2</hyp:promo>
    </hyp:RetrieveTimeTableRequest>
  </soapenv:Body>
</soapenv:Envelope>